<template>
  <div class="description-wrapp">
    <center>
      <h1 class="description-title">
        Фотоискусство в тренде. Любая фотоссесия ваша история
      </h1>
    </center>
    <p class="description-text">
      Мы искренни так считаем и готовы кричать эту фразу на весь мир. Фотографии
      давно перестали пылиться на полках в семейных, потрёпанных альбомах.
    </p>
    <p class="description-text">
      Хотите самовыразиться и не знаете как? Позвоните нам и закажите
      фотосъемку. Хотите удивить и впечатлить? Мы вам поможем. Не уверены?
      Посмотрите отзывы и проконсультируйтесь. Боитесь фотографироваться? Наши
      локации помогут вам расслабиться и почувствовать себя как дома.
    </p>
    <p class="description-text">Доступные цены для всех и вежливость.</p>
    <p class="description-text">
      Повторим еще раз: мы работаем в первую очередь для клиентов, и аренда
      нашей фотостудии имеют цены семи чашек кофе. Вы можете расплатится любым
      удобным для вас способом: наличным или безналичным расчетом. Все для
      вашего удобства.
    </p>
    <p class="description-text">
      Вежливость тоже относиться к главным нашим качествам. У нас вы не найдете
      ужасного обращения, мы всегда готовы ответить вам и проконсультировать,
      помочь и стать вашими друзьями. Все наши работники улыбчивы и приветливы
      вам, которые не оставят вам плохого настроения.
    </p>
    <p class="description-text">
      В каждом городе есть хотя бы несколько фотостудий и часто поход туда,
      становиться чуть ли не традицией семьи, пар или друзей. Тренд на истории в
      фотографиях для социальных сетей, где мы проводим много времени, не угасал
      и не угаснет никогда. Фотоссесия лав стори или семейная привлекает
      внимание всех людей и, доказано, набирает больше всего одобрений со
      стороны людей всего мира. Для качественного исполнения вашей мечты стоит
      обращаться к профессионалу и выбирать интересные локации.
    </p>
    <p class="description-text">
      Наша фотостудия предлагает и то, и то. Профессиональный фотограф сможет
      сделать качественные, интересные фотографии, помочь вам воплотить вашу
      идею в жизнь в уютных залах фотостудии.
    </p>
    <p class="description-text">
      На ваш выбор у нас есть 7 фотозалов, каждый из которых прекрасен и
      индивидуален по-своему. В больших залах отлично будет смотреться групповая
      фотосессия, а в залах меньше получиться интересная фотоссесия в деловом
      стиле.
    </p>
    <p class="description-text">
      Мы работаем в первую очередь на качество, поэтому наши цены не завышенные
      и доступны всем желающим. У нас есть различные и удобные способы оплаты
      для вас.
    </p>
  </div>
</template>

<script>
export default {
  name: "DescriptionComponent2",
};
</script>

<style lang="scss">
.description-wrapp {
  padding: 60px 100px 98px 100px;
  background: #f9f4ee;

  @media screen and (max-width: 1024px) and (min-width: 768px) {
    .description-wrapp {
      padding: 60px 80px 51px 80px;
    }
  }
}
@media screen and (max-width: 768px) {
  .description-wrapp {
    padding: 30px 16px 76px 16px;
  }
}
</style>