<template>
  <div class="description-wrapper">
    <center>
      <h1 class="description-title">Фотостудия для любых идейных фотоссесий</h1>
    </center>
    <p
      v-for="(text, index) in paragraphs"
      :key="index"
      style="line-height: 26px"
      class="description-text"
    >
      {{ text }}
    </p>
  </div>
</template>

<script>
export default {
  name: "DescriptionComponent",

  data() {
    return {
      paragraphs: [
        "Воплотите мечту с нашей фотостудией и приобретите красивые, уникальные, качественные фотографии, выбрав один из наших залов. А их, -на секундочку, -аж семь штук.",
        "Каждый наш зал оборудован интерьером и профессиональным оборудованием, и подойдет для любой фотоссесии, а мы хотим рассказать вам о все подробнее.",
        "Какие идеи можно воплотить?",
        "• Фотоссесия Love Story",
        "Мечтаете показать всему миру вашу историю создания любви или хранить снимки в памятном альбоме, то это фотоссесия отлично подойдет вам. Расскажите вашу историю с любимым человеком в фотографиях в необычном месте.",
        "• Семейная фотоссесия",
        "Семья — это самое главное в жизни любого человека. Хотите повесить фотографии в вашем уютном доме, смотреть на них и испытывать прилив нежности, значит семейная фотоссесия в нашей фотостудии станет отличным вариантом.",
        "• Фотоссесия для беременных девушек",
        "Желаете сохранить воспоминания о прекрасном времени в жизни каждой женщины? Наши локации помогут вам организовать и воссоздать в фотографиях любовь матери и еще не родившегося ребенка.",
        "• Фотоссесия «Деловой стиль».",
        "Вы не из тех, кто любит яркие чувства, эмоции и считаете себя сдержанным. Вам нужны фотографии, где вы раскроетесь как профессионал, произведете впечатление как деловой человек. Эта фотоссесия станет вашим правильным решением.",
        "• Фотоссесия для девушек и парней.",
        "Хочешь стать кем-то другим? Или, наоборот, показать свое «я»? Фотоссесия для девушек или парней поможет воплотить любые идеи.",
        "Помимо вышеперечисленного есть и другие стили фотоссесий. Вы самостоятельно выбираете, а наши фотозалы помогают вам и вдохновляют.",
        "Кстати, о них…",
        "Все семь фото локаций уникальные в своем роде. Мы пытались воссоздать непохожесть на другие фотостудии не только в городе, но и во всей стране. Каждый зал отличается от других по дизайнерскому решению и интерьеру. И каждый зал пропитан своим духом, стилем и видится для каждого нашего посетителя по-разному.",
        "Светлые помещения помогут получить более качественные, яркие фотоснимки. Трендовая мебель и другие предметы интерьера можно двигать и активно использовать в фотосъемках. Локации подойдут для любых людей и задач: блогеров и медийных личностей, обычных и счастливых семей, предпринимателей и подростков.",
        "Что еще нужно знать о нас?",
        "Оборудование. Неотъемлемая часть любой фотостудии и нередко владельцы фотостудий экономят на этой важной части. Мы используем все оборудование только от профессиональных продавцов, которые уже не один год предлагают свои товары на мировом рынке. Вы найдете все что нужно и необходимо для работы фотографов, для создания образов и света. Ведь именно от оборудования часто зависит качество получающихся фотоснимков.",
      ],
    };
  },
};
</script>

<style lang="scss">
.description-wrapper {
  padding: 60px 100px 98px 100px;
  background: #e5e5e5;

  @media screen and (max-width: 1024px) and (min-width: 768px) {
    .description-wrapper {
      padding: 60px 80px 51px 80px;
    }
  }
}
@media screen and (max-width: 768px) {
  .description-wrapper {
    padding: 30px 16px 76px 16px;
   
  }

  .description-title {
    width: 100%;
  }

  .description-text {
     text-align: center;
  }
}
</style>